Therefore a recommendation system is a system in which we recommend something to someone. Eg -  
* Teacher recommends us to read books
* Amazon recommends us the similar products to buy , etc.
* Youtube shows us similar movies, videos ,etc.

## Recommendation Systems are of 2 types

* Content Bases R.S
* Collabrative Filtering
<img src='photos.png'>

#### Content Based Recommendation System

In this as we can see that apple is liked by all users ,  Therefore they have some similar liking. Since User 1 and User 2 likes orange too, therefore we should recommend orange to User 3 too as we can see most of the user likes orange too.
Since this R.S is easy as compared to Collabrative Filterering , therefore Recommendation System we would be making will be of this type.

#### Collabrative Filtering

Collabrating Filtering R.S is the Recommendation system which is used in real scenarios and is very effective and complex. In this how is works is that -
* Both User 1 User 2 - Likes pizza and pasta. Therefore they like similar things.
* Since User 2 also likes Pepsi , now first check if User 2 has ordered coke before or not -  
 * If he has ordered before and not bought it now, it means he doesn't like coke. So we should not recommend it.
 * if he has not ordered before and both users have similar types of interest , therefore we should recommend it to User 1 too

# Movie Recommendation System

Data set which we will be using is Movie lens Dataset 

Download it from here - https://grouplens.org/datasets/movielens/100k/ and move the file to the required folder.

In [3]:
import numpy as np
import pandas as pd
import warnings

In [4]:
### Therefore this warning module will be used to ignore all the warning which we are going to get in this project
warnings.filterwarnings('ignore')

### Get The Dataset

In [7]:
# Note - if we will see that u.data is not a csv file instead all the values are seperated by a '\t' instead of ','
# Therefore read_csv files can read such Tab Seperated files(TSV - Tab Seperated Values ) too , if we could exclusively
# mention it.

df = pd.read_csv('ml-100k/u.data',sep='\t')
df.head()

   196  242  3  881250949
0  186  302  3  891717742
1   22  377  1  878887116
2  244   51  2  880606923
3  166  346  1  886397596
4  298  474  4  884182806

In [8]:
column_names = ['user_id','item_id','rating','timestamp'] #If we would see the readme file, here is what each column 
#of this file represents where 
"""
user_id = ID of the user
item_id = ID of the movie, which the user has rated
rating = rating given by the user
timestamp = It will not be used in our project , but it basically represents after how much years after the release of 
the movie , the user has rated it.
"""
df = pd.read_csv('ml-100k/u.data',sep='\t',names = column_names)
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [9]:
print(df.shape)

(100000, 4)

In [10]:
# Getting all the unique users_id and unique movies_id
unique_users = np.unique(df['user_id'])
unique_item_id = np.unique(df['item_id'])

In [11]:
print(len(unique_users))
print(len(unique_item_id))

#Therefore there are only 943 unique users

943
1682

In [16]:
### now let's get the movie titles from the u.item file -
movie_titles = pd.read_csv('ml-100k/u.item',sep='\|',header=None)
movie_titles.head()

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [17]:
## Since we just need first 2 columns i.e movie_id and its corrensponding name, therefore filter other data out
movie_titles = movie_titles.iloc[:,:2]
movie_titles.head()

   0                  1
0  1   Toy Story (1995)
1  2   GoldenEye (1995)
2  3  Four Rooms (1995)
3  4  Get Shorty (1995)
4  5     Copycat (1995)

In [18]:
## let's insert column names too in this dataframe - 
movie_titles.columns = ['item_id','title']
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [19]:
# Now what we should do is that, we should merge 2 datagrames such that in the first dataframe , corresponding to that
# item_id , we should get the movie title from the other dataframe.

df = pd.merge(df,movie_titles,on='item_id') #This item will be compared in both the dataframes to merge these both DF
df.head()

   user_id  item_id  rating  timestamp         title
0      196      242       3  881250949  Kolya (1996)
1       63      242       3  875747190  Kolya (1996)
2      226      242       5  883888671  Kolya (1996)
3      154      242       3  879138235  Kolya (1996)
4      306      242       5  876503793  Kolya (1996)

# Exploratory Data Analysis

In [20]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')